{
  "en": {
    "support_faq_reset_answer": "Tap 'Reset Progress' at the bottom of the Home Screen to clear all learning data for your profile.",
    "support_faq_languages_answer": "The app supports 15 languages: English, French, Spanish, German, Italian, Dutch, Portuguese, Russian, Ukrainian, Polish, Japanese, Chinese, Korean, Arabic, and Hindi.",
    "languages": "15 Languages",
    "languages_desc": "Full support for English, French, Spanish, German, Italian, Dutch, Portuguese, Russian, Ukrainian, Polish, Japanese, Chinese, Korean, Arabic, and Hindi.",
    "support_faq_category_gameplay": "Gameplay",
    "support_faq_mastery": "What counts as 'mastered'?",
    "support_faq_mastery_answer": "A multiplication is mastered when you answer it correctly 3 times in a row. Mastered facts appear white in the progress grid.",
    "support_faq_trophies": "How many trophies are there?",
    "support_faq_trophies_answer": "There are 27 trophies across 6 categories: Learn, Time Attack, Reverse, Missing Number, Mastery, and General achievements.",
    "support_faq_timeattack": "How does Time Attack work?",
    "support_faq_timeattack_answer": "You have 6 seconds to answer each question. Answer correctly to keep your streak going. Your best score is saved.",
    "support_faq_category_profiles": "Profiles & Data",
    "support_faq_delete_profile": "How do I delete a profile?",
    "support_faq_delete_profile_answer": "Long-press on a profile name on the profile selection screen to delete it and all its data.",
    "support_faq_category_voice": "Voice Recognition",
    "support_faq_voice_not_working": "Voice recognition isn't working. What should I do?",
    "support_faq_voice_not_working_answer": "Make sure you've granted microphone permission to the app. Check that your device language matches the app language. Speak clearly and wait for the microphone icon before answering.",
    "support_faq_voice_numbers": "Can I say numbers in words?",
    "support_faq_voice_numbers_answer": "Yes! You can say 'forty-two' or '42' - the app understands both spoken words and digits in all supported languages."
  },
  "fr": {
    "support_faq_reset_answer": "Appuyez sur 'Réinitialiser' en bas de l'écran d'accueil pour effacer toutes les données d'apprentissage de votre profil.",
    "support_faq_languages_answer": "L'app supporte 15 langues : anglais, français, espagnol, allemand, italien, néerlandais, portugais, russe, ukrainien, polonais, japonais, chinois, coréen, arabe et hindi.",
    "languages": "15 langues",
    "languages_desc": "Support complet pour l'anglais, français, espagnol, allemand, italien, néerlandais, portugais, russe, ukrainien, polonais, japonais, chinois, coréen, arabe et hindi.",
    "support_faq_category_gameplay": "Jeu",
    "support_faq_mastery": "Qu'est-ce qui compte comme 'maîtrisé' ?",
    "support_faq_mastery_answer": "Une multiplication est maîtrisée quand vous répondez correctement 3 fois de suite. Les faits maîtrisés apparaissent en blanc dans la grille.",
    "support_faq_trophies": "Combien y a-t-il de trophées ?",
    "support_faq_trophies_answer": "Il y a 27 trophées dans 6 catégories : Apprentissage, Contre la montre, Inversé, Nombre manquant, Maîtrise et Général.",
    "support_faq_timeattack": "Comment fonctionne le Contre la montre ?",
    "support_faq_timeattack_answer": "Vous avez 6 secondes pour répondre à chaque question. Répondez correctement pour maintenir votre série. Votre meilleur score est sauvegardé.",
    "support_faq_category_profiles": "Profils et données",
    "support_faq_delete_profile": "Comment supprimer un profil ?",
    "support_faq_delete_profile_answer": "Appuyez longuement sur un nom de profil sur l'écran de sélection pour le supprimer avec toutes ses données.",
    "support_faq_category_voice": "Reconnaissance vocale",
    "support_faq_voice_not_working": "La reconnaissance vocale ne fonctionne pas. Que faire ?",
    "support_faq_voice_not_working_answer": "Vérifiez que vous avez autorisé l'accès au microphone. Assurez-vous que la langue de votre appareil correspond à celle de l'app. Parlez clairement et attendez l'icône du micro.",
    "support_faq_voice_numbers": "Puis-je dire les nombres en lettres ?",
    "support_faq_voice_numbers_answer": "Oui ! Vous pouvez dire 'quarante-deux' ou '42' - l'app comprend les deux dans toutes les langues supportées."
  }
}
